       IDENTIFICATION DIVISION.
       PROGRAM-ID. Dumb.
       AUTHOR. Scimitaria.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 Arg  PIC X(38).
       01 Num  PIC 9(38).

       PROCEDURE DIVISION.
           ACCEPT Arg FROM COMMAND-LINE.
           UNSTRING Arg DELIMITED BY SPACE INTO Num.
           EVALUATE Num
            WHEN 1 DISPLAY '1 is odd'
            WHEN 2 DISPLAY '2 is even'
            WHEN 3 DISPLAY '3 is odd'
            WHEN 4 DISPLAY '4 is even'
            WHEN 5 DISPLAY '5 is odd'
            WHEN 6 DISPLAY '6 is even'
            WHEN 7 DISPLAY '7 is odd'
            WHEN 8 DISPLAY '8 is even'
            WHEN 9 DISPLAY '9 is odd'
            WHEN 10 DISPLAY '10 is even'
            WHEN 11 DISPLAY '11 is odd'
            WHEN 12 DISPLAY '12 is even'
            WHEN 13 DISPLAY '13 is odd'
            WHEN 14 DISPLAY '14 is even'
            WHEN 15 DISPLAY '15 is odd'
            WHEN 16 DISPLAY '16 is even'
            WHEN 17 DISPLAY '17 is odd'
            WHEN 18 DISPLAY '18 is even'
            WHEN 19 DISPLAY '19 is odd'
            WHEN 20 DISPLAY '20 is even'
            WHEN 21 DISPLAY '21 is odd'
            WHEN 22 DISPLAY '22 is even'
            WHEN 23 DISPLAY '23 is odd'
            WHEN 24 DISPLAY '24 is even'
            WHEN 25 DISPLAY '25 is odd'
            WHEN 26 DISPLAY '26 is even'
            WHEN 27 DISPLAY '27 is odd'
            WHEN 28 DISPLAY '28 is even'
            WHEN 29 DISPLAY '29 is odd'
            WHEN 30 DISPLAY '30 is even'
            WHEN 31 DISPLAY '31 is odd'
            WHEN 32 DISPLAY '32 is even'
            WHEN 33 DISPLAY '33 is odd'
            WHEN 34 DISPLAY '34 is even'
            WHEN 35 DISPLAY '35 is odd'
            WHEN 36 DISPLAY '36 is even'
            WHEN 37 DISPLAY '37 is odd'
            WHEN 38 DISPLAY '38 is even'
            WHEN 39 DISPLAY '39 is odd'
            WHEN 40 DISPLAY '40 is even'
            WHEN 41 DISPLAY '41 is odd'
            WHEN 42 DISPLAY '42 is even'
            WHEN 43 DISPLAY '43 is odd'
            WHEN 44 DISPLAY '44 is even'
            WHEN 45 DISPLAY '45 is odd'
            WHEN 46 DISPLAY '46 is even'
            WHEN 47 DISPLAY '47 is odd'
            WHEN 48 DISPLAY '48 is even'
            WHEN 49 DISPLAY '49 is odd'
            WHEN 50 DISPLAY '50 is even'
            WHEN 51 DISPLAY '51 is odd'
            WHEN 52 DISPLAY '52 is even'
            WHEN 53 DISPLAY '53 is odd'
            WHEN 54 DISPLAY '54 is even'
            WHEN 55 DISPLAY '55 is odd'
            WHEN 56 DISPLAY '56 is even'
            WHEN 57 DISPLAY '57 is odd'
            WHEN 58 DISPLAY '58 is even'
            WHEN 59 DISPLAY '59 is odd'
            WHEN 60 DISPLAY '60 is even'
            WHEN 61 DISPLAY '61 is odd'
            WHEN 62 DISPLAY '62 is even'
            WHEN 63 DISPLAY '63 is odd'
            WHEN 64 DISPLAY '64 is even'
            WHEN 65 DISPLAY '65 is odd'
            WHEN 66 DISPLAY '66 is even'
            WHEN 67 DISPLAY '67 is odd'
            WHEN 68 DISPLAY '68 is even'
            WHEN 69 DISPLAY '69 is odd'
            WHEN 70 DISPLAY '70 is even'
            WHEN 71 DISPLAY '71 is odd'
            WHEN 72 DISPLAY '72 is even'
            WHEN 73 DISPLAY '73 is odd'
            WHEN 74 DISPLAY '74 is even'
            WHEN 75 DISPLAY '75 is odd'
            WHEN 76 DISPLAY '76 is even'
            WHEN 77 DISPLAY '77 is odd'
            WHEN 78 DISPLAY '78 is even'
            WHEN 79 DISPLAY '79 is odd'
            WHEN 80 DISPLAY '80 is even'
            WHEN 81 DISPLAY '81 is odd'
            WHEN 82 DISPLAY '82 is even'
            WHEN 83 DISPLAY '83 is odd'
            WHEN 84 DISPLAY '84 is even'
            WHEN 85 DISPLAY '85 is odd'
            WHEN 86 DISPLAY '86 is even'
            WHEN 87 DISPLAY '87 is odd'
            WHEN 88 DISPLAY '88 is even'
            WHEN 89 DISPLAY '89 is odd'
            WHEN 90 DISPLAY '90 is even'
            WHEN 91 DISPLAY '91 is odd'
            WHEN 92 DISPLAY '92 is even'
            WHEN 93 DISPLAY '93 is odd'
            WHEN 94 DISPLAY '94 is even'
            WHEN 95 DISPLAY '95 is odd'
            WHEN 96 DISPLAY '96 is even'
            WHEN 97 DISPLAY '97 is odd'
            WHEN 98 DISPLAY '98 is even'
            WHEN 99 DISPLAY '99 is odd'
            WHEN 100 DISPLAY '100 is even'
            WHEN 101 DISPLAY '101 is odd'
            WHEN 102 DISPLAY '102 is even'
            WHEN 103 DISPLAY '103 is odd'
            WHEN 104 DISPLAY '104 is even'
            WHEN 105 DISPLAY '105 is odd'
            WHEN 106 DISPLAY '106 is even'
            WHEN 107 DISPLAY '107 is odd'
            WHEN 108 DISPLAY '108 is even'
            WHEN 109 DISPLAY '109 is odd'
            WHEN 110 DISPLAY '110 is even'
            WHEN 111 DISPLAY '111 is odd'
            WHEN 112 DISPLAY '112 is even'
            WHEN 113 DISPLAY '113 is odd'
            WHEN 114 DISPLAY '114 is even'
            WHEN 115 DISPLAY '115 is odd'
            WHEN 116 DISPLAY '116 is even'
            WHEN 117 DISPLAY '117 is odd'
            WHEN 118 DISPLAY '118 is even'
            WHEN 119 DISPLAY '119 is odd'
            WHEN 120 DISPLAY '120 is even'
            WHEN 121 DISPLAY '121 is odd'
            WHEN 122 DISPLAY '122 is even'
            WHEN 123 DISPLAY '123 is odd'
            WHEN 124 DISPLAY '124 is even'
            WHEN 125 DISPLAY '125 is odd'
            WHEN 126 DISPLAY '126 is even'
            WHEN 127 DISPLAY '127 is odd'
            WHEN 128 DISPLAY '128 is even'
            WHEN 129 DISPLAY '129 is odd'
            WHEN 130 DISPLAY '130 is even'
            WHEN 131 DISPLAY '131 is odd'
            WHEN 132 DISPLAY '132 is even'
            WHEN 133 DISPLAY '133 is odd'
            WHEN 134 DISPLAY '134 is even'
            WHEN 135 DISPLAY '135 is odd'
            WHEN 136 DISPLAY '136 is even'
            WHEN 137 DISPLAY '137 is odd'
            WHEN 138 DISPLAY '138 is even'
            WHEN 139 DISPLAY '139 is odd'
            WHEN 140 DISPLAY '140 is even'
            WHEN 141 DISPLAY '141 is odd'
            WHEN 142 DISPLAY '142 is even'
            WHEN 143 DISPLAY '143 is odd'
            WHEN 144 DISPLAY '144 is even'
            WHEN 145 DISPLAY '145 is odd'
            WHEN 146 DISPLAY '146 is even'
            WHEN 147 DISPLAY '147 is odd'
            WHEN 148 DISPLAY '148 is even'
            WHEN 149 DISPLAY '149 is odd'
            WHEN 150 DISPLAY '150 is even'
            WHEN 151 DISPLAY '151 is odd'
            WHEN 152 DISPLAY '152 is even'
            WHEN 153 DISPLAY '153 is odd'
            WHEN 154 DISPLAY '154 is even'
            WHEN 155 DISPLAY '155 is odd'
            WHEN 156 DISPLAY '156 is even'
            WHEN 157 DISPLAY '157 is odd'
            WHEN 158 DISPLAY '158 is even'
            WHEN 159 DISPLAY '159 is odd'
            WHEN 160 DISPLAY '160 is even'
            WHEN 161 DISPLAY '161 is odd'
            WHEN 162 DISPLAY '162 is even'
            WHEN 163 DISPLAY '163 is odd'
            WHEN 164 DISPLAY '164 is even'
            WHEN 165 DISPLAY '165 is odd'
            WHEN 166 DISPLAY '166 is even'
            WHEN 167 DISPLAY '167 is odd'
            WHEN 168 DISPLAY '168 is even'
            WHEN 169 DISPLAY '169 is odd'
            WHEN 170 DISPLAY '170 is even'
            WHEN 171 DISPLAY '171 is odd'
            WHEN 172 DISPLAY '172 is even'
            WHEN 173 DISPLAY '173 is odd'
            WHEN 174 DISPLAY '174 is even'
            WHEN 175 DISPLAY '175 is odd'
            WHEN 176 DISPLAY '176 is even'
            WHEN 177 DISPLAY '177 is odd'
            WHEN 178 DISPLAY '178 is even'
            WHEN 179 DISPLAY '179 is odd'
            WHEN 180 DISPLAY '180 is even'
            WHEN 181 DISPLAY '181 is odd'
            WHEN 182 DISPLAY '182 is even'
            WHEN 183 DISPLAY '183 is odd'
            WHEN 184 DISPLAY '184 is even'
            WHEN 185 DISPLAY '185 is odd'
            WHEN 186 DISPLAY '186 is even'
            WHEN 187 DISPLAY '187 is odd'
            WHEN 188 DISPLAY '188 is even'
            WHEN 189 DISPLAY '189 is odd'
            WHEN 190 DISPLAY '190 is even'
            WHEN 191 DISPLAY '191 is odd'
            WHEN 192 DISPLAY '192 is even'
            WHEN 193 DISPLAY '193 is odd'
            WHEN 194 DISPLAY '194 is even'
            WHEN 195 DISPLAY '195 is odd'
            WHEN 196 DISPLAY '196 is even'
            WHEN 197 DISPLAY '197 is odd'
            WHEN 198 DISPLAY '198 is even'
            WHEN 199 DISPLAY '199 is odd'
            WHEN 200 DISPLAY '200 is even'
            WHEN 201 DISPLAY '201 is odd'
            WHEN 202 DISPLAY '202 is even'
            WHEN 203 DISPLAY '203 is odd'
            WHEN 204 DISPLAY '204 is even'
            WHEN 205 DISPLAY '205 is odd'
            WHEN 206 DISPLAY '206 is even'
            WHEN 207 DISPLAY '207 is odd'
            WHEN 208 DISPLAY '208 is even'
            WHEN 209 DISPLAY '209 is odd'
            WHEN 210 DISPLAY '210 is even'
            WHEN 211 DISPLAY '211 is odd'
            WHEN 212 DISPLAY '212 is even'
            WHEN 213 DISPLAY '213 is odd'
            WHEN 214 DISPLAY '214 is even'
            WHEN 215 DISPLAY '215 is odd'
            WHEN 216 DISPLAY '216 is even'
            WHEN 217 DISPLAY '217 is odd'
            WHEN 218 DISPLAY '218 is even'
            WHEN 219 DISPLAY '219 is odd'
            WHEN 220 DISPLAY '220 is even'
            WHEN 221 DISPLAY '221 is odd'
            WHEN 222 DISPLAY '222 is even'
            WHEN 223 DISPLAY '223 is odd'
            WHEN 224 DISPLAY '224 is even'
            WHEN 225 DISPLAY '225 is odd'
            WHEN 226 DISPLAY '226 is even'
            WHEN 227 DISPLAY '227 is odd'
            WHEN 228 DISPLAY '228 is even'
            WHEN 229 DISPLAY '229 is odd'
            WHEN 230 DISPLAY '230 is even'
            WHEN 231 DISPLAY '231 is odd'
            WHEN 232 DISPLAY '232 is even'
            WHEN 233 DISPLAY '233 is odd'
            WHEN 234 DISPLAY '234 is even'
            WHEN 235 DISPLAY '235 is odd'
            WHEN 236 DISPLAY '236 is even'
            WHEN 237 DISPLAY '237 is odd'
            WHEN 238 DISPLAY '238 is even'
            WHEN 239 DISPLAY '239 is odd'
            WHEN 240 DISPLAY '240 is even'
            WHEN 241 DISPLAY '241 is odd'
            WHEN 242 DISPLAY '242 is even'
            WHEN 243 DISPLAY '243 is odd'
            WHEN 244 DISPLAY '244 is even'
            WHEN 245 DISPLAY '245 is odd'
            WHEN 246 DISPLAY '246 is even'
            WHEN 247 DISPLAY '247 is odd'
            WHEN 248 DISPLAY '248 is even'
            WHEN 249 DISPLAY '249 is odd'
            WHEN 250 DISPLAY '250 is even'
            WHEN 251 DISPLAY '251 is odd'
            WHEN 252 DISPLAY '252 is even'
            WHEN 253 DISPLAY '253 is odd'
            WHEN 254 DISPLAY '254 is even'
            WHEN 255 DISPLAY '255 is odd'
            WHEN 256 DISPLAY '256 is even'
            WHEN 257 DISPLAY '257 is odd'
            WHEN 258 DISPLAY '258 is even'
            WHEN 259 DISPLAY '259 is odd'
            WHEN 260 DISPLAY '260 is even'
            WHEN 261 DISPLAY '261 is odd'
            WHEN 262 DISPLAY '262 is even'
            WHEN 263 DISPLAY '263 is odd'
            WHEN 264 DISPLAY '264 is even'
            WHEN 265 DISPLAY '265 is odd'
            WHEN 266 DISPLAY '266 is even'
            WHEN 267 DISPLAY '267 is odd'
            WHEN 268 DISPLAY '268 is even'
            WHEN 269 DISPLAY '269 is odd'
            WHEN 270 DISPLAY '270 is even'
            WHEN 271 DISPLAY '271 is odd'
            WHEN 272 DISPLAY '272 is even'
            WHEN 273 DISPLAY '273 is odd'
            WHEN 274 DISPLAY '274 is even'
            WHEN 275 DISPLAY '275 is odd'
            WHEN 276 DISPLAY '276 is even'
            WHEN 277 DISPLAY '277 is odd'
            WHEN 278 DISPLAY '278 is even'
            WHEN 279 DISPLAY '279 is odd'
            WHEN 280 DISPLAY '280 is even'
            WHEN 281 DISPLAY '281 is odd'
            WHEN 282 DISPLAY '282 is even'
            WHEN 283 DISPLAY '283 is odd'
            WHEN 284 DISPLAY '284 is even'
            WHEN 285 DISPLAY '285 is odd'
            WHEN 286 DISPLAY '286 is even'
            WHEN 287 DISPLAY '287 is odd'
            WHEN 288 DISPLAY '288 is even'
            WHEN 289 DISPLAY '289 is odd'
            WHEN 290 DISPLAY '290 is even'
            WHEN 291 DISPLAY '291 is odd'
            WHEN 292 DISPLAY '292 is even'
            WHEN 293 DISPLAY '293 is odd'
            WHEN 294 DISPLAY '294 is even'
            WHEN 295 DISPLAY '295 is odd'
            WHEN 296 DISPLAY '296 is even'
            WHEN 297 DISPLAY '297 is odd'
            WHEN 298 DISPLAY '298 is even'
            WHEN 299 DISPLAY '299 is odd'
            WHEN 300 DISPLAY '300 is even'
            WHEN 301 DISPLAY '301 is odd'
            WHEN 302 DISPLAY '302 is even'
            WHEN 303 DISPLAY '303 is odd'
            WHEN 304 DISPLAY '304 is even'
            WHEN 305 DISPLAY '305 is odd'
            WHEN 306 DISPLAY '306 is even'
            WHEN 307 DISPLAY '307 is odd'
            WHEN 308 DISPLAY '308 is even'
            WHEN 309 DISPLAY '309 is odd'
            WHEN 310 DISPLAY '310 is even'
            WHEN 311 DISPLAY '311 is odd'
            WHEN 312 DISPLAY '312 is even'
            WHEN 313 DISPLAY '313 is odd'
            WHEN 314 DISPLAY '314 is even'
            WHEN 315 DISPLAY '315 is odd'
            WHEN 316 DISPLAY '316 is even'
            WHEN 317 DISPLAY '317 is odd'
            WHEN 318 DISPLAY '318 is even'
            WHEN 319 DISPLAY '319 is odd'
            WHEN 320 DISPLAY '320 is even'
            WHEN 321 DISPLAY '321 is odd'
            WHEN 322 DISPLAY '322 is even'
            WHEN 323 DISPLAY '323 is odd'
            WHEN 324 DISPLAY '324 is even'
            WHEN 325 DISPLAY '325 is odd'
            WHEN 326 DISPLAY '326 is even'
            WHEN 327 DISPLAY '327 is odd'
            WHEN 328 DISPLAY '328 is even'
            WHEN 329 DISPLAY '329 is odd'
            WHEN 330 DISPLAY '330 is even'
            WHEN 331 DISPLAY '331 is odd'
            WHEN 332 DISPLAY '332 is even'
            WHEN 333 DISPLAY '333 is odd'
            WHEN 334 DISPLAY '334 is even'
            WHEN 335 DISPLAY '335 is odd'
            WHEN 336 DISPLAY '336 is even'
            WHEN 337 DISPLAY '337 is odd'
            WHEN 338 DISPLAY '338 is even'
            WHEN 339 DISPLAY '339 is odd'
            WHEN 340 DISPLAY '340 is even'
            WHEN 341 DISPLAY '341 is odd'
            WHEN 342 DISPLAY '342 is even'
            WHEN 343 DISPLAY '343 is odd'
            WHEN 344 DISPLAY '344 is even'
            WHEN 345 DISPLAY '345 is odd'
            WHEN 346 DISPLAY '346 is even'
            WHEN 347 DISPLAY '347 is odd'
            WHEN 348 DISPLAY '348 is even'
            WHEN 349 DISPLAY '349 is odd'
            WHEN 350 DISPLAY '350 is even'
            WHEN 351 DISPLAY '351 is odd'
            WHEN 352 DISPLAY '352 is even'
            WHEN 353 DISPLAY '353 is odd'
            WHEN 354 DISPLAY '354 is even'
            WHEN 355 DISPLAY '355 is odd'
            WHEN 356 DISPLAY '356 is even'
            WHEN 357 DISPLAY '357 is odd'
            WHEN 358 DISPLAY '358 is even'
            WHEN 359 DISPLAY '359 is odd'
            WHEN 360 DISPLAY '360 is even'
            WHEN 361 DISPLAY '361 is odd'
            WHEN 362 DISPLAY '362 is even'
            WHEN 363 DISPLAY '363 is odd'
            WHEN 364 DISPLAY '364 is even'
            WHEN 365 DISPLAY '365 is odd'
            WHEN 366 DISPLAY '366 is even'
            WHEN 367 DISPLAY '367 is odd'
            WHEN 368 DISPLAY '368 is even'
            WHEN 369 DISPLAY '369 is odd'
            WHEN 370 DISPLAY '370 is even'
            WHEN 371 DISPLAY '371 is odd'
            WHEN 372 DISPLAY '372 is even'
            WHEN 373 DISPLAY '373 is odd'
            WHEN 374 DISPLAY '374 is even'
            WHEN 375 DISPLAY '375 is odd'
            WHEN 376 DISPLAY '376 is even'
            WHEN 377 DISPLAY '377 is odd'
            WHEN 378 DISPLAY '378 is even'
            WHEN 379 DISPLAY '379 is odd'
            WHEN 380 DISPLAY '380 is even'
            WHEN 381 DISPLAY '381 is odd'
            WHEN 382 DISPLAY '382 is even'
            WHEN 383 DISPLAY '383 is odd'
            WHEN 384 DISPLAY '384 is even'
            WHEN 385 DISPLAY '385 is odd'
            WHEN 386 DISPLAY '386 is even'
            WHEN 387 DISPLAY '387 is odd'
            WHEN 388 DISPLAY '388 is even'
            WHEN 389 DISPLAY '389 is odd'
            WHEN 390 DISPLAY '390 is even'
            WHEN 391 DISPLAY '391 is odd'
            WHEN 392 DISPLAY '392 is even'
            WHEN 393 DISPLAY '393 is odd'
            WHEN 394 DISPLAY '394 is even'
            WHEN 395 DISPLAY '395 is odd'
            WHEN 396 DISPLAY '396 is even'
            WHEN 397 DISPLAY '397 is odd'
            WHEN 398 DISPLAY '398 is even'
            WHEN 399 DISPLAY '399 is odd'
            WHEN 400 DISPLAY '400 is even'
            WHEN 401 DISPLAY '401 is odd'
            WHEN 402 DISPLAY '402 is even'
            WHEN 403 DISPLAY '403 is odd'
            WHEN 404 DISPLAY '404 is even'
            WHEN 405 DISPLAY '405 is odd'
            WHEN 406 DISPLAY '406 is even'
            WHEN 407 DISPLAY '407 is odd'
            WHEN 408 DISPLAY '408 is even'
            WHEN 409 DISPLAY '409 is odd'
            WHEN 410 DISPLAY '410 is even'
            WHEN 411 DISPLAY '411 is odd'
            WHEN 412 DISPLAY '412 is even'
            WHEN 413 DISPLAY '413 is odd'
            WHEN 414 DISPLAY '414 is even'
            WHEN 415 DISPLAY '415 is odd'
            WHEN 416 DISPLAY '416 is even'
            WHEN 417 DISPLAY '417 is odd'
            WHEN 418 DISPLAY '418 is even'
            WHEN 419 DISPLAY '419 is odd'
            WHEN 420 DISPLAY '420 is even'
            WHEN 421 DISPLAY '421 is odd'
            WHEN 422 DISPLAY '422 is even'
            WHEN 423 DISPLAY '423 is odd'
            WHEN 424 DISPLAY '424 is even'
            WHEN 425 DISPLAY '425 is odd'
            WHEN 426 DISPLAY '426 is even'
            WHEN 427 DISPLAY '427 is odd'
            WHEN 428 DISPLAY '428 is even'
            WHEN 429 DISPLAY '429 is odd'
            WHEN 430 DISPLAY '430 is even'
            WHEN 431 DISPLAY '431 is odd'
            WHEN 432 DISPLAY '432 is even'
            WHEN 433 DISPLAY '433 is odd'
            WHEN 434 DISPLAY '434 is even'
            WHEN 435 DISPLAY '435 is odd'
            WHEN 436 DISPLAY '436 is even'
            WHEN 437 DISPLAY '437 is odd'
            WHEN 438 DISPLAY '438 is even'
            WHEN 439 DISPLAY '439 is odd'
            WHEN 440 DISPLAY '440 is even'
            WHEN 441 DISPLAY '441 is odd'
            WHEN 442 DISPLAY '442 is even'
            WHEN 443 DISPLAY '443 is odd'
            WHEN 444 DISPLAY '444 is even'
            WHEN 445 DISPLAY '445 is odd'
            WHEN 446 DISPLAY '446 is even'
            WHEN 447 DISPLAY '447 is odd'
            WHEN 448 DISPLAY '448 is even'
            WHEN 449 DISPLAY '449 is odd'
            WHEN 450 DISPLAY '450 is even'
            WHEN 451 DISPLAY '451 is odd'
            WHEN 452 DISPLAY '452 is even'
            WHEN 453 DISPLAY '453 is odd'
            WHEN 454 DISPLAY '454 is even'
            WHEN 455 DISPLAY '455 is odd'
            WHEN 456 DISPLAY '456 is even'
            WHEN 457 DISPLAY '457 is odd'
            WHEN 458 DISPLAY '458 is even'
            WHEN 459 DISPLAY '459 is odd'
            WHEN 460 DISPLAY '460 is even'
            WHEN 461 DISPLAY '461 is odd'
            WHEN 462 DISPLAY '462 is even'
            WHEN 463 DISPLAY '463 is odd'
            WHEN 464 DISPLAY '464 is even'
            WHEN 465 DISPLAY '465 is odd'
            WHEN 466 DISPLAY '466 is even'
            WHEN 467 DISPLAY '467 is odd'
            WHEN 468 DISPLAY '468 is even'
            WHEN 469 DISPLAY '469 is odd'
            WHEN 470 DISPLAY '470 is even'
            WHEN 471 DISPLAY '471 is odd'
            WHEN 472 DISPLAY '472 is even'
            WHEN 473 DISPLAY '473 is odd'
            WHEN 474 DISPLAY '474 is even'
            WHEN 475 DISPLAY '475 is odd'
            WHEN 476 DISPLAY '476 is even'
            WHEN 477 DISPLAY '477 is odd'
            WHEN 478 DISPLAY '478 is even'
            WHEN 479 DISPLAY '479 is odd'
            WHEN 480 DISPLAY '480 is even'
            WHEN 481 DISPLAY '481 is odd'
            WHEN 482 DISPLAY '482 is even'
            WHEN 483 DISPLAY '483 is odd'
            WHEN 484 DISPLAY '484 is even'
            WHEN 485 DISPLAY '485 is odd'
            WHEN 486 DISPLAY '486 is even'
            WHEN 487 DISPLAY '487 is odd'
            WHEN 488 DISPLAY '488 is even'
            WHEN 489 DISPLAY '489 is odd'
            WHEN 490 DISPLAY '490 is even'
            WHEN 491 DISPLAY '491 is odd'
            WHEN 492 DISPLAY '492 is even'
            WHEN 493 DISPLAY '493 is odd'
            WHEN 494 DISPLAY '494 is even'
            WHEN 495 DISPLAY '495 is odd'
            WHEN 496 DISPLAY '496 is even'
            WHEN 497 DISPLAY '497 is odd'
            WHEN 498 DISPLAY '498 is even'
            WHEN 499 DISPLAY '499 is odd'
            WHEN 500 DISPLAY '500 is even'
            WHEN 501 DISPLAY '501 is odd'
            WHEN 502 DISPLAY '502 is even'
            WHEN 503 DISPLAY '503 is odd'
            WHEN 504 DISPLAY '504 is even'
            WHEN 505 DISPLAY '505 is odd'
            WHEN 506 DISPLAY '506 is even'
            WHEN 507 DISPLAY '507 is odd'
            WHEN 508 DISPLAY '508 is even'
            WHEN 509 DISPLAY '509 is odd'
            WHEN 510 DISPLAY '510 is even'
            WHEN 511 DISPLAY '511 is odd'
            WHEN 512 DISPLAY '512 is even'
            WHEN 513 DISPLAY '513 is odd'
            WHEN 514 DISPLAY '514 is even'
            WHEN 515 DISPLAY '515 is odd'
            WHEN 516 DISPLAY '516 is even'
            WHEN 517 DISPLAY '517 is odd'
            WHEN 518 DISPLAY '518 is even'
            WHEN 519 DISPLAY '519 is odd'
            WHEN 520 DISPLAY '520 is even'
            WHEN 521 DISPLAY '521 is odd'
            WHEN 522 DISPLAY '522 is even'
            WHEN 523 DISPLAY '523 is odd'
            WHEN 524 DISPLAY '524 is even'
            WHEN 525 DISPLAY '525 is odd'
            WHEN 526 DISPLAY '526 is even'
            WHEN 527 DISPLAY '527 is odd'
            WHEN 528 DISPLAY '528 is even'
            WHEN 529 DISPLAY '529 is odd'
            WHEN 530 DISPLAY '530 is even'
            WHEN 531 DISPLAY '531 is odd'
            WHEN 532 DISPLAY '532 is even'
            WHEN 533 DISPLAY '533 is odd'
            WHEN 534 DISPLAY '534 is even'
            WHEN 535 DISPLAY '535 is odd'
            WHEN 536 DISPLAY '536 is even'
            WHEN 537 DISPLAY '537 is odd'
            WHEN 538 DISPLAY '538 is even'
            WHEN 539 DISPLAY '539 is odd'
            WHEN 540 DISPLAY '540 is even'
            WHEN 541 DISPLAY '541 is odd'
            WHEN 542 DISPLAY '542 is even'
            WHEN 543 DISPLAY '543 is odd'
            WHEN 544 DISPLAY '544 is even'
            WHEN 545 DISPLAY '545 is odd'
            WHEN 546 DISPLAY '546 is even'
            WHEN 547 DISPLAY '547 is odd'
            WHEN 548 DISPLAY '548 is even'
            WHEN 549 DISPLAY '549 is odd'
            WHEN 550 DISPLAY '550 is even'
            WHEN 551 DISPLAY '551 is odd'
            WHEN 552 DISPLAY '552 is even'
            WHEN 553 DISPLAY '553 is odd'
            WHEN 554 DISPLAY '554 is even'
            WHEN 555 DISPLAY '555 is odd'
            WHEN 556 DISPLAY '556 is even'
            WHEN 557 DISPLAY '557 is odd'
            WHEN 558 DISPLAY '558 is even'
            WHEN 559 DISPLAY '559 is odd'
            WHEN 560 DISPLAY '560 is even'
            WHEN 561 DISPLAY '561 is odd'
            WHEN 562 DISPLAY '562 is even'
            WHEN 563 DISPLAY '563 is odd'
            WHEN 564 DISPLAY '564 is even'
            WHEN 565 DISPLAY '565 is odd'
            WHEN 566 DISPLAY '566 is even'
            WHEN 567 DISPLAY '567 is odd'
            WHEN 568 DISPLAY '568 is even'
            WHEN 569 DISPLAY '569 is odd'
            WHEN 570 DISPLAY '570 is even'
            WHEN 571 DISPLAY '571 is odd'
            WHEN 572 DISPLAY '572 is even'
            WHEN 573 DISPLAY '573 is odd'
            WHEN 574 DISPLAY '574 is even'
            WHEN 575 DISPLAY '575 is odd'
            WHEN 576 DISPLAY '576 is even'
            WHEN 577 DISPLAY '577 is odd'
            WHEN 578 DISPLAY '578 is even'
            WHEN 579 DISPLAY '579 is odd'
            WHEN 580 DISPLAY '580 is even'
            WHEN 581 DISPLAY '581 is odd'
            WHEN 582 DISPLAY '582 is even'
            WHEN 583 DISPLAY '583 is odd'
            WHEN 584 DISPLAY '584 is even'
            WHEN 585 DISPLAY '585 is odd'
            WHEN 586 DISPLAY '586 is even'
            WHEN 587 DISPLAY '587 is odd'
            WHEN 588 DISPLAY '588 is even'
            WHEN 589 DISPLAY '589 is odd'
            WHEN 590 DISPLAY '590 is even'
            WHEN 591 DISPLAY '591 is odd'
            WHEN 592 DISPLAY '592 is even'
            WHEN 593 DISPLAY '593 is odd'
            WHEN 594 DISPLAY '594 is even'
            WHEN 595 DISPLAY '595 is odd'
            WHEN 596 DISPLAY '596 is even'
            WHEN 597 DISPLAY '597 is odd'
            WHEN 598 DISPLAY '598 is even'
            WHEN 599 DISPLAY '599 is odd'
            WHEN 600 DISPLAY '600 is even'
            WHEN 601 DISPLAY '601 is odd'
            WHEN 602 DISPLAY '602 is even'
            WHEN 603 DISPLAY '603 is odd'
            WHEN 604 DISPLAY '604 is even'
            WHEN 605 DISPLAY '605 is odd'
            WHEN 606 DISPLAY '606 is even'
            WHEN 607 DISPLAY '607 is odd'
            WHEN 608 DISPLAY '608 is even'
            WHEN 609 DISPLAY '609 is odd'
            WHEN 610 DISPLAY '610 is even'
            WHEN 611 DISPLAY '611 is odd'
            WHEN 612 DISPLAY '612 is even'
            WHEN 613 DISPLAY '613 is odd'
            WHEN 614 DISPLAY '614 is even'
            WHEN 615 DISPLAY '615 is odd'
            WHEN 616 DISPLAY '616 is even'
            WHEN 617 DISPLAY '617 is odd'
            WHEN 618 DISPLAY '618 is even'
            WHEN 619 DISPLAY '619 is odd'
            WHEN 620 DISPLAY '620 is even'
            WHEN 621 DISPLAY '621 is odd'
            WHEN 622 DISPLAY '622 is even'
            WHEN 623 DISPLAY '623 is odd'
            WHEN 624 DISPLAY '624 is even'
            WHEN 625 DISPLAY '625 is odd'
            WHEN 626 DISPLAY '626 is even'
            WHEN 627 DISPLAY '627 is odd'
            WHEN 628 DISPLAY '628 is even'
            WHEN 629 DISPLAY '629 is odd'
            WHEN 630 DISPLAY '630 is even'
            WHEN 631 DISPLAY '631 is odd'
            WHEN 632 DISPLAY '632 is even'
            WHEN 633 DISPLAY '633 is odd'
            WHEN 634 DISPLAY '634 is even'
            WHEN 635 DISPLAY '635 is odd'
            WHEN 636 DISPLAY '636 is even'
            WHEN 637 DISPLAY '637 is odd'
            WHEN 638 DISPLAY '638 is even'
            WHEN 639 DISPLAY '639 is odd'
            WHEN 640 DISPLAY '640 is even'
            WHEN 641 DISPLAY '641 is odd'
            WHEN 642 DISPLAY '642 is even'
            WHEN 643 DISPLAY '643 is odd'
            WHEN 644 DISPLAY '644 is even'
            WHEN 645 DISPLAY '645 is odd'
            WHEN 646 DISPLAY '646 is even'
            WHEN 647 DISPLAY '647 is odd'
            WHEN 648 DISPLAY '648 is even'
            WHEN 649 DISPLAY '649 is odd'
            WHEN 650 DISPLAY '650 is even'
            WHEN 651 DISPLAY '651 is odd'
            WHEN 652 DISPLAY '652 is even'
            WHEN 653 DISPLAY '653 is odd'
            WHEN 654 DISPLAY '654 is even'
            WHEN 655 DISPLAY '655 is odd'
            WHEN 656 DISPLAY '656 is even'
            WHEN 657 DISPLAY '657 is odd'
            WHEN 658 DISPLAY '658 is even'
            WHEN 659 DISPLAY '659 is odd'
            WHEN 660 DISPLAY '660 is even'
            WHEN 661 DISPLAY '661 is odd'
            WHEN 662 DISPLAY '662 is even'
            WHEN 663 DISPLAY '663 is odd'
            WHEN 664 DISPLAY '664 is even'
            WHEN 665 DISPLAY '665 is odd'
            WHEN 666 DISPLAY '666 is even'
            WHEN 667 DISPLAY '667 is odd'
            WHEN 668 DISPLAY '668 is even'
            WHEN 669 DISPLAY '669 is odd'
            WHEN 670 DISPLAY '670 is even'
            WHEN 671 DISPLAY '671 is odd'
            WHEN 672 DISPLAY '672 is even'
            WHEN 673 DISPLAY '673 is odd'
            WHEN 674 DISPLAY '674 is even'
            WHEN 675 DISPLAY '675 is odd'
            WHEN 676 DISPLAY '676 is even'
            WHEN 677 DISPLAY '677 is odd'
            WHEN 678 DISPLAY '678 is even'
            WHEN 679 DISPLAY '679 is odd'
            WHEN 680 DISPLAY '680 is even'
            WHEN 681 DISPLAY '681 is odd'
            WHEN 682 DISPLAY '682 is even'
            WHEN 683 DISPLAY '683 is odd'
            WHEN 684 DISPLAY '684 is even'
            WHEN 685 DISPLAY '685 is odd'
            WHEN 686 DISPLAY '686 is even'
            WHEN 687 DISPLAY '687 is odd'
            WHEN 688 DISPLAY '688 is even'
            WHEN 689 DISPLAY '689 is odd'
            WHEN 690 DISPLAY '690 is even'
            WHEN 691 DISPLAY '691 is odd'
            WHEN 692 DISPLAY '692 is even'
            WHEN 693 DISPLAY '693 is odd'
            WHEN 694 DISPLAY '694 is even'
            WHEN 695 DISPLAY '695 is odd'
            WHEN 696 DISPLAY '696 is even'
            WHEN 697 DISPLAY '697 is odd'
            WHEN 698 DISPLAY '698 is even'
            WHEN 699 DISPLAY '699 is odd'
            WHEN 700 DISPLAY '700 is even'
            WHEN 701 DISPLAY '701 is odd'
            WHEN 702 DISPLAY '702 is even'
            WHEN 703 DISPLAY '703 is odd'
            WHEN 704 DISPLAY '704 is even'
            WHEN 705 DISPLAY '705 is odd'
            WHEN 706 DISPLAY '706 is even'
            WHEN 707 DISPLAY '707 is odd'
            WHEN 708 DISPLAY '708 is even'
            WHEN 709 DISPLAY '709 is odd'
            WHEN 710 DISPLAY '710 is even'
            WHEN 711 DISPLAY '711 is odd'
            WHEN 712 DISPLAY '712 is even'
            WHEN 713 DISPLAY '713 is odd'
            WHEN 714 DISPLAY '714 is even'
            WHEN 715 DISPLAY '715 is odd'
            WHEN 716 DISPLAY '716 is even'
            WHEN 717 DISPLAY '717 is odd'
            WHEN 718 DISPLAY '718 is even'
            WHEN 719 DISPLAY '719 is odd'
            WHEN 720 DISPLAY '720 is even'
            WHEN 721 DISPLAY '721 is odd'
            WHEN 722 DISPLAY '722 is even'
            WHEN 723 DISPLAY '723 is odd'
            WHEN 724 DISPLAY '724 is even'
            WHEN 725 DISPLAY '725 is odd'
            WHEN 726 DISPLAY '726 is even'
            WHEN 727 DISPLAY '727 is odd'
            WHEN 728 DISPLAY '728 is even'
            WHEN 729 DISPLAY '729 is odd'
            WHEN 730 DISPLAY '730 is even'
            WHEN 731 DISPLAY '731 is odd'
            WHEN 732 DISPLAY '732 is even'
            WHEN 733 DISPLAY '733 is odd'
            WHEN 734 DISPLAY '734 is even'
            WHEN 735 DISPLAY '735 is odd'
            WHEN 736 DISPLAY '736 is even'
            WHEN 737 DISPLAY '737 is odd'
            WHEN 738 DISPLAY '738 is even'
            WHEN 739 DISPLAY '739 is odd'
            WHEN 740 DISPLAY '740 is even'
            WHEN 741 DISPLAY '741 is odd'
            WHEN 742 DISPLAY '742 is even'
            WHEN 743 DISPLAY '743 is odd'
            WHEN 744 DISPLAY '744 is even'
            WHEN 745 DISPLAY '745 is odd'
            WHEN 746 DISPLAY '746 is even'
            WHEN 747 DISPLAY '747 is odd'
            WHEN 748 DISPLAY '748 is even'
            WHEN 749 DISPLAY '749 is odd'
            WHEN 750 DISPLAY '750 is even'
            WHEN 751 DISPLAY '751 is odd'
            WHEN 752 DISPLAY '752 is even'
            WHEN 753 DISPLAY '753 is odd'
            WHEN 754 DISPLAY '754 is even'
            WHEN 755 DISPLAY '755 is odd'
            WHEN 756 DISPLAY '756 is even'
            WHEN 757 DISPLAY '757 is odd'
            WHEN 758 DISPLAY '758 is even'
            WHEN 759 DISPLAY '759 is odd'
            WHEN 760 DISPLAY '760 is even'
            WHEN 761 DISPLAY '761 is odd'
            WHEN 762 DISPLAY '762 is even'
            WHEN 763 DISPLAY '763 is odd'
            WHEN 764 DISPLAY '764 is even'
            WHEN 765 DISPLAY '765 is odd'
            WHEN 766 DISPLAY '766 is even'
            WHEN 767 DISPLAY '767 is odd'
            WHEN 768 DISPLAY '768 is even'
            WHEN 769 DISPLAY '769 is odd'
            WHEN 770 DISPLAY '770 is even'
            WHEN 771 DISPLAY '771 is odd'
            WHEN 772 DISPLAY '772 is even'
            WHEN 773 DISPLAY '773 is odd'
            WHEN 774 DISPLAY '774 is even'
            WHEN 775 DISPLAY '775 is odd'
            WHEN 776 DISPLAY '776 is even'
            WHEN 777 DISPLAY '777 is odd'
            WHEN 778 DISPLAY '778 is even'
            WHEN 779 DISPLAY '779 is odd'
            WHEN 780 DISPLAY '780 is even'
            WHEN 781 DISPLAY '781 is odd'
            WHEN 782 DISPLAY '782 is even'
            WHEN 783 DISPLAY '783 is odd'
            WHEN 784 DISPLAY '784 is even'
            WHEN 785 DISPLAY '785 is odd'
            WHEN 786 DISPLAY '786 is even'
            WHEN 787 DISPLAY '787 is odd'
            WHEN 788 DISPLAY '788 is even'
            WHEN 789 DISPLAY '789 is odd'
            WHEN 790 DISPLAY '790 is even'
            WHEN 791 DISPLAY '791 is odd'
            WHEN 792 DISPLAY '792 is even'
            WHEN 793 DISPLAY '793 is odd'
            WHEN 794 DISPLAY '794 is even'
            WHEN 795 DISPLAY '795 is odd'
            WHEN 796 DISPLAY '796 is even'
            WHEN 797 DISPLAY '797 is odd'
            WHEN 798 DISPLAY '798 is even'
            WHEN 799 DISPLAY '799 is odd'
            WHEN 800 DISPLAY '800 is even'
            WHEN 801 DISPLAY '801 is odd'
            WHEN 802 DISPLAY '802 is even'
            WHEN 803 DISPLAY '803 is odd'
            WHEN 804 DISPLAY '804 is even'
            WHEN 805 DISPLAY '805 is odd'
            WHEN 806 DISPLAY '806 is even'
            WHEN 807 DISPLAY '807 is odd'
            WHEN 808 DISPLAY '808 is even'
            WHEN 809 DISPLAY '809 is odd'
            WHEN 810 DISPLAY '810 is even'
            WHEN 811 DISPLAY '811 is odd'
            WHEN 812 DISPLAY '812 is even'
            WHEN 813 DISPLAY '813 is odd'
            WHEN 814 DISPLAY '814 is even'
            WHEN 815 DISPLAY '815 is odd'
            WHEN 816 DISPLAY '816 is even'
            WHEN 817 DISPLAY '817 is odd'
            WHEN 818 DISPLAY '818 is even'
            WHEN 819 DISPLAY '819 is odd'
            WHEN 820 DISPLAY '820 is even'
            WHEN 821 DISPLAY '821 is odd'
            WHEN 822 DISPLAY '822 is even'
            WHEN 823 DISPLAY '823 is odd'
            WHEN 824 DISPLAY '824 is even'
            WHEN 825 DISPLAY '825 is odd'
            WHEN 826 DISPLAY '826 is even'
            WHEN 827 DISPLAY '827 is odd'
            WHEN 828 DISPLAY '828 is even'
            WHEN 829 DISPLAY '829 is odd'
            WHEN 830 DISPLAY '830 is even'
            WHEN 831 DISPLAY '831 is odd'
            WHEN 832 DISPLAY '832 is even'
            WHEN 833 DISPLAY '833 is odd'
            WHEN 834 DISPLAY '834 is even'
            WHEN 835 DISPLAY '835 is odd'
            WHEN 836 DISPLAY '836 is even'
            WHEN 837 DISPLAY '837 is odd'
            WHEN 838 DISPLAY '838 is even'
            WHEN 839 DISPLAY '839 is odd'
            WHEN 840 DISPLAY '840 is even'
            WHEN 841 DISPLAY '841 is odd'
            WHEN 842 DISPLAY '842 is even'
            WHEN 843 DISPLAY '843 is odd'
            WHEN 844 DISPLAY '844 is even'
            WHEN 845 DISPLAY '845 is odd'
            WHEN 846 DISPLAY '846 is even'
            WHEN 847 DISPLAY '847 is odd'
            WHEN 848 DISPLAY '848 is even'
            WHEN 849 DISPLAY '849 is odd'
            WHEN 850 DISPLAY '850 is even'
            WHEN 851 DISPLAY '851 is odd'
            WHEN 852 DISPLAY '852 is even'
            WHEN 853 DISPLAY '853 is odd'
            WHEN 854 DISPLAY '854 is even'
            WHEN 855 DISPLAY '855 is odd'
            WHEN 856 DISPLAY '856 is even'
            WHEN 857 DISPLAY '857 is odd'
            WHEN 858 DISPLAY '858 is even'
            WHEN 859 DISPLAY '859 is odd'
            WHEN 860 DISPLAY '860 is even'
            WHEN 861 DISPLAY '861 is odd'
            WHEN 862 DISPLAY '862 is even'
            WHEN 863 DISPLAY '863 is odd'
            WHEN 864 DISPLAY '864 is even'
            WHEN 865 DISPLAY '865 is odd'
            WHEN 866 DISPLAY '866 is even'
            WHEN 867 DISPLAY '867 is odd'
            WHEN 868 DISPLAY '868 is even'
            WHEN 869 DISPLAY '869 is odd'
            WHEN 870 DISPLAY '870 is even'
            WHEN 871 DISPLAY '871 is odd'
            WHEN 872 DISPLAY '872 is even'
            WHEN 873 DISPLAY '873 is odd'
            WHEN 874 DISPLAY '874 is even'
            WHEN 875 DISPLAY '875 is odd'
            WHEN 876 DISPLAY '876 is even'
            WHEN 877 DISPLAY '877 is odd'
            WHEN 878 DISPLAY '878 is even'
            WHEN 879 DISPLAY '879 is odd'
            WHEN 880 DISPLAY '880 is even'
            WHEN 881 DISPLAY '881 is odd'
            WHEN 882 DISPLAY '882 is even'
            WHEN 883 DISPLAY '883 is odd'
            WHEN 884 DISPLAY '884 is even'
            WHEN 885 DISPLAY '885 is odd'
            WHEN 886 DISPLAY '886 is even'
            WHEN 887 DISPLAY '887 is odd'
            WHEN 888 DISPLAY '888 is even'
            WHEN 889 DISPLAY '889 is odd'
            WHEN 890 DISPLAY '890 is even'
            WHEN 891 DISPLAY '891 is odd'
            WHEN 892 DISPLAY '892 is even'
            WHEN 893 DISPLAY '893 is odd'
            WHEN 894 DISPLAY '894 is even'
            WHEN 895 DISPLAY '895 is odd'
            WHEN 896 DISPLAY '896 is even'
            WHEN 897 DISPLAY '897 is odd'
            WHEN 898 DISPLAY '898 is even'
            WHEN 899 DISPLAY '899 is odd'
            WHEN 900 DISPLAY '900 is even'
            WHEN 901 DISPLAY '901 is odd'
            WHEN 902 DISPLAY '902 is even'
            WHEN 903 DISPLAY '903 is odd'
            WHEN 904 DISPLAY '904 is even'
            WHEN 905 DISPLAY '905 is odd'
            WHEN 906 DISPLAY '906 is even'
            WHEN 907 DISPLAY '907 is odd'
            WHEN 908 DISPLAY '908 is even'
            WHEN 909 DISPLAY '909 is odd'
            WHEN 910 DISPLAY '910 is even'
            WHEN 911 DISPLAY '911 is odd'
            WHEN 912 DISPLAY '912 is even'
            WHEN 913 DISPLAY '913 is odd'
            WHEN 914 DISPLAY '914 is even'
            WHEN 915 DISPLAY '915 is odd'
            WHEN 916 DISPLAY '916 is even'
            WHEN 917 DISPLAY '917 is odd'
            WHEN 918 DISPLAY '918 is even'
            WHEN 919 DISPLAY '919 is odd'
            WHEN 920 DISPLAY '920 is even'
            WHEN 921 DISPLAY '921 is odd'
            WHEN 922 DISPLAY '922 is even'
            WHEN 923 DISPLAY '923 is odd'
            WHEN 924 DISPLAY '924 is even'
            WHEN 925 DISPLAY '925 is odd'
            WHEN 926 DISPLAY '926 is even'
            WHEN 927 DISPLAY '927 is odd'
            WHEN 928 DISPLAY '928 is even'
            WHEN 929 DISPLAY '929 is odd'
            WHEN 930 DISPLAY '930 is even'
            WHEN 931 DISPLAY '931 is odd'
            WHEN 932 DISPLAY '932 is even'
            WHEN 933 DISPLAY '933 is odd'
            WHEN 934 DISPLAY '934 is even'
            WHEN 935 DISPLAY '935 is odd'
            WHEN 936 DISPLAY '936 is even'
            WHEN 937 DISPLAY '937 is odd'
            WHEN 938 DISPLAY '938 is even'
            WHEN 939 DISPLAY '939 is odd'
            WHEN 940 DISPLAY '940 is even'
            WHEN 941 DISPLAY '941 is odd'
            WHEN 942 DISPLAY '942 is even'
            WHEN 943 DISPLAY '943 is odd'
            WHEN 944 DISPLAY '944 is even'
            WHEN 945 DISPLAY '945 is odd'
            WHEN 946 DISPLAY '946 is even'
            WHEN 947 DISPLAY '947 is odd'
            WHEN 948 DISPLAY '948 is even'
            WHEN 949 DISPLAY '949 is odd'
            WHEN 950 DISPLAY '950 is even'
            WHEN 951 DISPLAY '951 is odd'
            WHEN 952 DISPLAY '952 is even'
            WHEN 953 DISPLAY '953 is odd'
            WHEN 954 DISPLAY '954 is even'
            WHEN 955 DISPLAY '955 is odd'
            WHEN 956 DISPLAY '956 is even'
            WHEN 957 DISPLAY '957 is odd'
            WHEN 958 DISPLAY '958 is even'
            WHEN 959 DISPLAY '959 is odd'
            WHEN 960 DISPLAY '960 is even'
            WHEN 961 DISPLAY '961 is odd'
            WHEN 962 DISPLAY '962 is even'
            WHEN 963 DISPLAY '963 is odd'
            WHEN 964 DISPLAY '964 is even'
            WHEN 965 DISPLAY '965 is odd'
            WHEN 966 DISPLAY '966 is even'
            WHEN 967 DISPLAY '967 is odd'
            WHEN 968 DISPLAY '968 is even'
            WHEN 969 DISPLAY '969 is odd'
            WHEN 970 DISPLAY '970 is even'
            WHEN 971 DISPLAY '971 is odd'
            WHEN 972 DISPLAY '972 is even'
            WHEN 973 DISPLAY '973 is odd'
            WHEN 974 DISPLAY '974 is even'
            WHEN 975 DISPLAY '975 is odd'
            WHEN 976 DISPLAY '976 is even'
            WHEN 977 DISPLAY '977 is odd'
            WHEN 978 DISPLAY '978 is even'
            WHEN 979 DISPLAY '979 is odd'
            WHEN 980 DISPLAY '980 is even'
            WHEN 981 DISPLAY '981 is odd'
            WHEN 982 DISPLAY '982 is even'
            WHEN 983 DISPLAY '983 is odd'
            WHEN 984 DISPLAY '984 is even'
            WHEN 985 DISPLAY '985 is odd'
            WHEN 986 DISPLAY '986 is even'
            WHEN 987 DISPLAY '987 is odd'
            WHEN 988 DISPLAY '988 is even'
            WHEN 989 DISPLAY '989 is odd'
            WHEN 990 DISPLAY '990 is even'
            WHEN 991 DISPLAY '991 is odd'
            WHEN 992 DISPLAY '992 is even'
            WHEN 993 DISPLAY '993 is odd'
            WHEN 994 DISPLAY '994 is even'
            WHEN 995 DISPLAY '995 is odd'
            WHEN 996 DISPLAY '996 is even'
            WHEN 997 DISPLAY '997 is odd'
            WHEN 998 DISPLAY '998 is even'
            WHEN 999 DISPLAY '999 is odd'
            WHEN 1000 DISPLAY '1000 is even'
           END-EVALUATE
       STOP RUN.
